app/controllers/answers_controller.rb

SELECT * FROM "answers" WHERE ("answers"."id" = 1)
---
  def show
    @answer = Answer.find(params[:id])