app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if current_user.articles << @article
---
INSERT INTO "articles" ("updated_at", "title", "pro", "guid", "excerpt", "aasm_state", "category_id", "content", "published_at", "comments_count", "user_id", "revision_of", "created_at") VALUES('2009-06-06 23:59:50', 'Something', 't', 'something', 'Oh really?', 'draft', 3, ' RubyGems is a package manager for Ruby. At GitHub, we''ve tried to make the process of building and releasing new gems as simple as possible. Please see the documentation below on how to use the system.

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 2)
UPDATE "articles" SET "content" = 'Always come to an end and in Philadelphia we may be witnessing one. A season that started off so strong for the Eagles has become an all but typical familiar pattern for Philly. On the same day that McNabb’s old university (Syracuse) fired their coach Greg Robinson, McNabb struggled unlike he has in quite some time. This was a game the Eagles had to win and even though the result was a tie they’ve set themselves up to miss out on another playoff run.

  def set_status
    unless (Article::EDITOR_ONLY.include?(params[:state]) && !current_user.has_role?(:editor)) || !Article.events.include?(params[:state])
---
SELECT * FROM "articles" WHERE ("articles".user_id = 1) AND ((aasm_state='published') AND ("articles".user_id = 1)) ORDER BY published_at DESC
SELECT * FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 1 )