app/controllers/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def show
    @category = Category.find(params[:id])

SELECT * FROM "sports"
---
  def new
    @category = Category.new
    @sports = Sport.all

SELECT * FROM "sports"
SELECT * FROM "categories" WHERE ("categories"."id" = 2)
---
  def edit
    @sports = Sport.all
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "updated_at", "sport_id", "articles_count", "created_at") VALUES('Test Once Again', '2009-06-02 01:30:51', 1, NULL, '2009-06-02 01:30:51')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 2)
UPDATE "categories" SET "guid" = 'test', "updated_at" = '2009-06-06 18:04:22' WHERE "id" = 2
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE ("categories"."id" = 7)
DELETE FROM "categories" WHERE "id" = 7
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy