app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM "comments"