app/controllers/news_controller.rb

SELECT * FROM "articles" WHERE ("articles"."guid" = 'a-premium-article') LIMIT 1
---
  def article
    @article = Article.find_by_guid(params[:guid])

SELECT * FROM "categories" WHERE ("categories"."guid" = 'test-109') LIMIT 1
---
  def column
    @column = Category.find_by_guid(params[:guid])

SELECT * FROM "users" WHERE ("users"."login" = 'jimjeffers') LIMIT 1
---
  def author
    @author = User.find_by_login(params[:login])