app/controllers/news_controller.rb

  def index
    @articles = Article.find(:all)
---
SELECT * FROM "articles" WHERE (aasm_state IN ('published','featured')) ORDER BY published_at DESC

  def article
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 2)

  def sport
    @sport = Sport.find_by_guid(params[:guid])
---
SELECT * FROM "sports" WHERE ("sports"."guid" = 'nfl-2002') LIMIT 1