app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT * FROM "questions"

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions".sport_id = 1)