app/controllers/sports_controller.rb

  def index
    @sports = Sport.all
---
SELECT * FROM "sports"

  def show
    @sport = Sport.find(params[:id])
---
SELECT * FROM "sports" WHERE ("sports"."id" = 1)

  def edit
    @sport = Sport.find(params[:id])
---
SELECT * FROM "sports" WHERE ("sports"."id" = 1)

  def create
    @sport = Sport.new(params[:sport])

    respond_to do |format|
      if @sport.save
---
INSERT INTO "sports" ("name", "updated_at", "created_at") VALUES('Football', '2009-06-02 00:47:57', '2009-06-02 00:47:57')

  def update
    @sport = Sport.find(params[:id])

    respond_to do |format|
      if @sport.update_attributes(params[:sport])
---
SELECT * FROM "sports" WHERE ("sports"."id" = 1)
UPDATE "sports" SET "name" = 'NFL', "guid" = 'nfl', "updated_at" = '2009-06-05 22:14:24' WHERE "id" = 1