app/controllers/users_controller.rb

  def create
    logout_keeping_session! unless current_user.has_role?(:admin)
    @user = User.new(params[:user])
    success = @user && @user.save
    if success && @user.errors.empty?
---
INSERT INTO "users" ("name", "salt", "questions_count", "updated_at", "activated_at", "crypted_password", "remember_token_expires_at", "activation_code", "articles_count", "picks_count", "remember_token", "comments_count", "bio", "login", "answers_count", "email", "created_at") VALUES('Jim Jeffers', '9dc9afae44c9e16d7bca2363a717717f7a6ab168', NULL, '2009-06-08 21:34:24', NULL, 'eb9c60dbc1b80e04d990c33a96f365d0a9da2063', NULL, '66d51d98df522e1dc7d2be00f5023a8023ceef9c', NULL, NULL, NULL, NULL, NULL, 'cdf2009', NULL, 'jim@donttrustthisguy.com', '2009-06-08 21:34:24')
SELECT * FROM "users" WHERE (login = 'aaron') LIMIT 1
SELECT count(*) AS count_all FROM "users"

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM "users" WHERE ("users"."activation_code" = 'i_haxxor_joo') LIMIT 1

  def edit
    if current_user.has_role?(:admin)
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "name" = 'Zack Blog', "updated_at" = '2009-06-08 01:44:12' WHERE "id" = 2

  def add_role
    if current_user.has_role?(:admin)
      user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def remove_role
    if current_user.has_role?(:admin)
      user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1